ACHIEVEMENTS = [
    ("old", {
        "name": "Олды тут",
        "description": "Участник Клуба с момента его основания. "
                       "Входил в первую тысячу активных пользователей. "
                       "Видел, как Си-лучи мерцают во тьме близ врат Тангейзера. "
                       "Штурмовые корабли в огне на подступах к Ориону и вот это всё.",
        "image": "/static/images/badges/year-2.png",
        "style": "color: #FFF; background-color: #65c3ba;",
    }),
    ("investor", {
        "name": "Инвестор",
        "description": "Человек, вложивший $1000 и более на развитие Клуба. "
                       "Учитываются все ежемесячные платежи, внутренние покупки и переводы.",
        "image": "",
        "style": "",
    }),
    ("contributor", {
        "name": "Контрибьютор",
        "description": "Коммитил в код Клуба на гитхабе. ",
        "image": "",
        "style": "",
    }),
    ("moderator", {
        "name": "Модератор",
        "description": "Активный модератор Клуба. Может редактировать, удалять и банить. "
                       "Наличие этого бейджика подтверждает, что человек действительно назначен администрацией.",
        "image": "",
        "style": "",
    }),
]
