LABELS = {
    "meta": {
        "title": "Мета-пост",
        "description": "Пост, собирающий полезную информацию от разных авторов из Клуба и Чатов",
        "emoji": "📖",
        "color": "#ED5F1E",
        "notify": False
    },
    "ama": {
        "title": "АМА",
        "description": "Ask Me Anything",
        "emoji": "✋️",
        "color": "#1c4e30",
        "notify": False
    },
    "approved": {
        "title": "Офигенно",
        "description": "Золотой фонд постов Клуба",
        "emoji": "🤙",
        "color": "#FE4365",
        "notify": True
    },
    "inside": {
        "title": "Инсайды",
        "description": "Посты с тонной личного опыта и погружением в тему изнутри",
        "emoji": "💎️",
        "color": "#3498DB",
        "notify": True
    },
    "thread": {
        "title": "Тред",
        "description": "Посты со структурированной дискуссией в комментариях",
        "emoji": "🗄",
        "color": "#6950c3",
        "notify": True
    },
    "comments": {
        "title": "Топ комменты",
        "emoji": "💭",
        "color": "#F39C12",
        "notify": True
    },
    "top_week": {
        "title": "Тема недели",
        "description": "Движуха внутри Клуба для всех",
        "emoji": "🚀",
        "color": "#8E44AD",
        "notify": True
    },
    "wow": {
        "title": "Все ебанулись",
        "description": "Внутри происходит что-то странное, но всем весело",
        "emoji": "🌚️",
        "color": "#2b374b",
        "notify": True
    },
    "drama": {
        "title": "Драма",
        "description": "Без попкорна не входить",
        "emoji": "🍿",
        "color": "#0E2F44",
        "notify": True
    },
    "war": {
        "title": "Холивар",
        "description": "Все посрались в комментах, пост всех заебал и был скрыт с главной",
        "emoji": "⚠️️",
        "color": "#4f372d",
        "notify": False
    },
    "toxic": {
        "title": "Токсично",
        "description": "Неприятный пост, скрытый с главной",
        "emoji": "☢️",
        "color": "#4f372d",
        "notify": False
    },
    "essential": {
        "title": "Градообразующий пост",
        "description": "Важная веха в истории всего Клуба",
        "emoji": "🏛",
        "color": "#2ab7ca",
        "notify": True
    },
    "ad": {
        "title": "Спонсор",
        "description": "Проплаченный пост",
        "emoji": "💰",
        "color": "#F7DC6F",
        "notify": False
    },
    "inteview": {
        "title": "Интервью",
        "description": "Клубное интервью",
        "emoji": "🎙",
        "color": "#f75990",
        "notify": False
    },
}
