import random
from typing import TypedDict
from django.core.cache import cache
from club.exceptions import AccessDenied, ContentDuplicated, RateLimitException
from notifications.telegram.posts import send_published_post_to_moderators, notify_author_friends, \
    announce_in_online_channel, send_intro_changes_to_moderators, notify_post_label_changed, \
    notify_post_coauthors_changed
from django.views.decorators.http import require_http_methods

from authn.decorators.api import api
from club.exceptions import ApiException
from users.models.user import User

from users.models.user import User


class _Message(TypedDict):
    title: str
    message: str


def new_year(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Поздравление улетело поздравлять ❄️",
        message=random.choice(
            [
                "А все причастные поздравляют тебя в ответ! 🎄",
                "И тебя тоже с праздником! 🎆",
                "Клубни получили новогоднее поздравление 🎁",
                "Новый год начал обрабатываться 🌟",
                "Теперь самое время отвлечься от экранов и пойти праздновать 🥂",
                "Хо-хо-хо, Новый год стал новогоднее 🎅",
            ]
        ),
    )


def new_year_private(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:

    return True, _Message(
        title="Поздравление улетело клубню 📨",
        message=random.choice(
            [
                "Адресат уже мысленно чокается с тобой 🥂",
                "Кстати, оливье, правильно приготовленный, на следующий день вкуснее, чем в"
                " день приготовления. Ну, просто напоминаем.",
                "Но вот где же носит того седого старика, который что-то кому-то достаёт из"
                " рюкзака?",
                "Он стал чуточку счастливее 🎁",
                "Он там по ту сторону экрана улыбается, кстати (возможно, виноват глинтвейн).",
                "Праздник аккуратно передан точно в руки 🎄",
                "Слышишь? Куранты всё ближе 🔔",
                "Теперь у адресата официально праздничное настроение 📜",
            ]
        ),
    )


def valentine_common(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:

    return True, _Message(
        title="Вы публично рассказали свою любовь ☺️",
        message=random.choice(
            [
                "Клубни растроганы и слегка смущены 🌹",
                "Любовь синхронизирована 💞",
                "Причастные радостно получили сердечки 💖",
                "Сегодня разрешено быть сентиментальным 💝",
                "Эмоции доставлены в целости и нежности ❤",
            ]
        ),
    )


def valentine(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Шоколадка передана 🍫",
        message=random.choice(
            [
                "Теперь адресат знает, что вы его цените 💑🏻",
                "Правильно, любовь нужно дарить 💞",
                "Много любви не бывает 💕",
                "Не забудь, что тебя тоже любят! 🩷",
            ]
        ),
    )


def valentine_anonymous(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:

    return True, _Message(
        title="Валентинка отправлена 💌",
        message=random.choice(
            [
                "В мире стало чуть больше любви. И чуть больше неизвестности 🥷",
                "И мы передали её абсолютно анонимно 🤿",
                "И пусть адресат теперь гадает, от кого она 💟",
                "Но получатель не узнает, кто её отправил 🕵️🏻‍️",
            ]
        ),
    )


def leap_day(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Вы зафиксировали временной парадокс 👀",
        message=random.choice(
            [
                "Пусть все его наблюдают! 👓",
                "Следующий раз такое будет нескоро 🕖",
                "Этим вы сломали все наши даты 🔐",
            ]
        ),
    )


def fools_day(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Анекдот улетел куда надо 🤡",
        message=random.choice(
            [
                "Беги тоже его скорее читай 🎠",
                "Можно расслабиться и просто подурачиться 🪅",
                "И на что мы только тратим электроэнергию...",
                "А там армяне в нарды играют ♟️",
                "А куда надо ему как раз! 🎩",
                "Прилетел туда и сгорел 🐻",
                "Но есть один нюанс ☝",
            ]
        ),
    )


def cosmonautics_day(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:

    return True, _Message(
        title="Поздравление улетело 🚀",
        message=random.choice(
            [
                "Бип-бип-бип-бип, поздравление отправлено в чат 🛰️",
                "Сигнал совершил круг вокруг всей Земли, чтобы прилететь в чат 🌍",
                "Следующая остановка - Марс 👨‍🚀",
            ]
        ),
    )


def club_birthday(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Ура, Клуб поздравлен 🎉",
        message=random.choice(
            [
                "Все червячки отправились на праздник 🪱",
                "Держи тортик 🍰",
                "Еее, празднуем! 🎆",
                "Задуваем свечи и загадываем долгую счастливую жизнь (для Клуба) 🎂",
                "Тусим-тусим, праздник! 🎊",
            ]
        ),
    )


def summer_solstice(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:

    return True, _Message(
        title="На сегодняшнюю дату пролит свет ☀",
        message=random.choice(
            [
                "Несите дрова и медвежью шкуру! 🔥",
                "И да, уже почти прошёл июнь 🌞",
                "Кстати, держи венок, сегодня ты - Королева мая 🌼🌼🌼🌼",
            ]
        ),
    )


def friends_day(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Клубни поздравлены и дружелюбны 🧑‍🤝‍🧑",
        message=random.choice(
            [
                "А ещё дружба - не только станция метро в Ереване, держим в курсе 🍕",
                "Дружба, мир, жвачка! 🧙🏻‍♂️",
                "Мы все теперь друзяшки! 🤠",
            ]
        ),
    )


def friends_day_private(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:

    return True, _Message(
        title="Друг поздравлен 💅",
        message=random.choice(
            [
                "Дружба - это весело! Давайте дружить все?",
                "Кстати, глянь, где лежат [все друзяшки](https://vas3k.club/user/me/friends/).",
                "Теперь он знает, что он ваш друг. Наверное.",
                "Ты можешь поздравить и остальных своих друзей.\nПогоди, ты что, плачешь?",
            ]
        ),
    )


def cats_day(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Чат успешно назван котятами 🐱",
        message=random.choice(
            [
                "Все массово мурлыкают 😻",
                "И ты тоже котик 🐈",
                "Мяв. Мяв. Мур 🐈",
            ]
        ),
    )


def cats_day_private(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:

    return True, _Message(
        title="Адресат получил мявобщение 😼",
        message=random.choice(
            [
                "А глянь, какой ещё в Клубе есть [котик](https://vas3k.club/user/me/)!",
                "Мявмяв мяяв мур мявмяв. Мяв.\n\nВпрочем, забейте, это был _КОТОМБУР_.",
                "Надеемся, у него нет собаки. А то придётся лезть на дерево 🙀",
                "Ну вот, скатываемся. Точнее, _СКОТЫВАЕМСЯ_ 🐈",
                "Теперь вам придётся его гладить и кормить несколько раз в день 🐟",
                "Теперь он котик. И ты котик.",
            ]
        ),
    )


def testers_day(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Баги ÑƒÑ�Ð¿ÐµÑˆÐ½Ð¾ созданы 🪲",
        message=random.choice(
            [
                "[На главную](/user/me/edit/account/)",
                "{% MESSAGE_DETAILS_TEXT %}",
                "А сюда [.button.button-red НЕ НАЖИМАТЬ](/label/wow/)",
                "Было оповещено {receiver_count} человек.",
                "ЭТО СООБЩЕНИЕ ПОПАЛО СЮДА ПО НЕДОСМОТРУ РЕВЬЮЕРОВ ХЕХЕХЕ 🚨",
                '<a href="https://vas3k.club/">Вернуться на главную</a>',
            ]
        ),
    )


def halloween(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Хехехе, чат напуган 🎃",
        message=random.choice(
            [
                "**БУУУУ** 👻\n\nИ вы теперь напуганы.",
                "А вы задумывались, почему тыквенный спас ассоциируют со всякими пугалками? 🤔",
                "Но не переживайте, они всё понимают 🍁",
            ]
        ),
    )


def coffees_day(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:

    return True, _Message(
        title="Кофе в процессе доставки 🐌",
        message=random.choice(
            [
                "Чат можно было и пожалеть, там и так уже все от кофетрясутся! ☕",
                "Самое время лечь поспать 😴",
                "Теперь они немного более кофеинезированы ☕",
            ]
        ),
    )


def western_christmas(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:

    return True, _Message(
        title="Чат поздравлен 💫",
        message=random.choice(
            [
                "Заваривайте чашечку глинтвейна и залетайте с ним в"
                " [Бар](https://vas3k.club/room/bar/chat/) 🥃",
                "И тебя с праздником! 🎄",
                "Он родился. А что произошло дальше, мы с вами сейчас и узнаем 🐙",
            ]
        ),
    )


def western_christmas_private(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:

    return True, _Message(
        title="Поздравление улетело 💫",
        message=random.choice(
            [
                "А что это ещё летит? А, это вайб на подлёте! Вот он: ✨✨✨",
                "Мы передадим его с рождественскими эльфами 🧝🏻",
                "Не забудьте поздравить и тех, кто не из клуба! ☃️",
                "Оно попало прямо под ёлочку 🎁",
                "Сезон праздников начинается, самое время вайбить! 🎇",
                "Что ж, а теперь пора праздновать! 🍾",
            ]
        ),
    )


def unexpected_day(
    sender: User, recipient: User | None = None
) -> tuple[bool, _Message]:
    notifications = [
        "{sender} заметил то, что старалось быть незамеченным.",
        "{sender} стал свидетелем процесса, который не был запланирован.",
        "Аномалия, обнаруженная {sender}, передана в профильный отдел анализа аномалий.",
        "Благодаря {sender} стало ясно, что всё не так просто.",
        "В ходе наблюдения {sender} были зафиксированы отклонения от штатного режима.",
        "Обнаруженное {sender} отправлено на дальшейшее изучение.",
        "По версии {sender}, происходит нечто подозрительно неклассифицируемое.",
        "По информации {sender}, происходит некое несоответствие установленным параметрам.",
        "Сигнал, поступивший от {sender}, классифицирован как нестандартный.",
        "Согласно наблюдениям {sender}, стабильность нестабильна.",
    ]

    return True, _Message(
        title="Об этом инциденте теперь знают все 👾",
        message=random.choice(
            [
                "Дальше ситуация находится под контролем 🇦🇶️",
                "Запущен внутренний протокол реагирования 📡",
                "Истинная причина будет выяснена 👽",
                "Материалы переданы в профильные агентства 🛸",
                "Начата проверка по всем каналам 🔮",
                "Ответственные подразделения уже уведомлены 🕵️🏻",
            ]
        ),
    )


# =========


def miss(sender: User, recipient: User | None = None) -> tuple[bool, _Message]:
    return False, _Message(
        title="Что-то произошло, но мы не знаем, что 🐞",
        message=random.choice(
            [
                "Мы ожидали понятное, а пришло творческое 🧩",
                "Мы почти разобрались. Но почти не считается 🫠",
                "Мы честно пытались найти сценарий действий, но пусто 🔎",
                "Мы шли по инструкции, а она внезапно кончилась 👀",
                "О нет, всё поломалось. Мы к такому не готовились 😳",
                "Ой! Вы что-то нажали и всё сломалось 🌀",
                "Ой! Что-то пошло не так и эээ...\n\n**Fatal Error**: _Я сломался 🤖_",
                "Попробовали всё сделать хорошо. Но не получилось 🍿",
                "Свитки Мёртвого моря такого не предсказывали 👼🏻",
                "Сначала у нас план точно был. Потом он точно потерялся 📋",
                "Так-так, планировалось сделать всё как нужно, но получилось как всегда 🔧",
                "Это не входило в сценарий Seele 📱",
            ]
        ),
    )


def error_global_timeout_message() -> tuple[bool, _Message]:
    texts = []
    return False, _Message(
        title="Что-то произошло, но мы не знаем, что 🐞",
        message=random.choice(texts),
    )


def error_user_timeout_message() -> tuple[bool, _Message]:
    texts = []
    return False, _Message(
        title="Что-то произошло, но мы не знаем, что 🐞",
        message=random.choice(texts),
    )


def error_user_message_count_message() -> tuple[bool, _Message]:
    texts = []
    return False, _Message(
        title="Что-то произошло, но мы не знаем, что 🐞",
        message=random.choice(texts),
    )


ANTIC_HANDLERS = {
    "new_year": new_year,
    "new_year_private": new_year_private,
    "valentine_common": valentine_common,
    "valentine": valentine,
    "valentine_anonymous": valentine_anonymous,
    "leap_day": leap_day,
    "fools_day": fools_day,
    "cosmonautics_day": cosmonautics_day,
    "club_birthday": club_birthday,
    "summer_solstice": summer_solstice,
    "friends_day": friends_day,
    "friends_day_private": friends_day_private,
    "cats_day": cats_day,
    "cats_day_private": cats_day_private,
    "testers_day": testers_day,
    "halloween": halloween,
    "coffees_day": coffees_day,
    "western_christmas": western_christmas,
    "western_christmas_private": western_christmas_private,
    "unexpected_day": unexpected_day,
    "miss": miss,
}


# @api(require_auth=True)
# @require_http_methods(["POST"])
# def fun_(request, user_slug):
#     addressee = get_object_or_404(User, slug=user_slug)
#     if request.me == addressee:
#         raise ApiException(title="You can’t send a Valentine to yourself")
#
#     user_key = f"fun:valentine:{request.me.id}"
#     pair_key = f"fun:valentine:{request.me.id}-{addressee.id}"
#
#     if not addressee.get("have_valentine", False):
#         raise ApiException(title="You have already sent your Valentine")
#
#     return {
#         "status": "created" if is_created else "deleted",
#     }



